{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "BatchNormalization", "config": {"momentum": 0.99, "input_dtype": "float32", "trainable": true, "gamma_regularizer": null, "mode": 0, "batch_input_shape": [null, 16, 32, 3], "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "name": "batchnormalization_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_row": 3, "input_dtype": "float32", "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "nb_col": 3, "name": "convolution2d_1", "b_regularizer": null, "nb_filter": 24, "trainable": true, "subsample": [1, 1], "batch_input_shape": [null, 16, 32, 3], "bias": true, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_row": 5, "input_dtype": "float32", "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "nb_col": 5, "name": "convolution2d_2", "b_regularizer": null, "nb_filter": 32, "trainable": true, "subsample": [1, 1], "batch_input_shape": [null, 10, 28, 24], "bias": true, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_row": 3, "input_dtype": "float32", "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "nb_col": 3, "name": "convolution2d_3", "b_regularizer": null, "nb_filter": 32, "trainable": true, "subsample": [1, 1], "batch_input_shape": [null, 6, 24, 24], "bias": true, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_row": 4, "input_dtype": "float32", "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "nb_col": 4, "name": "convolution2d_4", "b_regularizer": null, "nb_filter": 64, "trainable": true, "subsample": [1, 1], "batch_input_shape": [null, 4, 22, 32], "bias": true, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "W_regularizer": null, "activation": "linear", "input_dim": 6720, "name": "dense_1", "W_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "output_dim": 1024, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "W_regularizer": null, "activation": "linear", "input_dim": 1024, "name": "dense_2", "W_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "output_dim": 512, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "W_regularizer": null, "activation": "linear", "input_dim": 512, "name": "dense_3", "W_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "output_dim": 1, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_7"}}]}